*** Pure Nim expressions

Essentially pure formulas are nothing but a template.
#+begin_src nim
f{1}
f{1.0}
f{"hello"}
f{1 + 2}
block:
  let x = 2
  f{1 + x}
block:
  proc foo(): int = 2
  f{foo()}
  f{1 + foo()}
  proc bar(x: int): int = 1 + x
  f{bar(2)}
  f{3 + bar(3)}
block:
  # control flow
  let x = 2
  f{if x > 1: 
      5
    else:
      10}
#+end_src

Possible implementation:
#+begin_src nim
import macros

template formula(body: untyped): untyped =
  body

macro `{}`(arg, stmts: untyped): untyped = 
  if arg.kind == nnkIdent and arg.strVal == "f":
    result = formula(stmts)
  else:
    error("Invalid formula!")

echo f{1 + 2}
let x = 2
echo f{if x > 1: 
         5
       else:
         10}
#+end_src

#+RESULTS:
| 3 |
| 5 |

This works fine. Invalid code will just generate a regular Nim
compilation error.

This means something like the following:
#+begin_src nim
import macros, ggplotnim

proc initVariable[T](x: T): FormulaNode =
  result = FormulaNode(name: "foo", kind: fkVariable, 
                       val: %~ x)

proc arePureFormula(n: NimNode): bool = true # a stub

macro foo(arg, stmts: untyped): untyped = 
  if arg.kind == nnkIdent and arg.strVal == "f":
    if stmts.arePureFormula():
      result = quote do:
        initVariable(`stmts`)
  else:
    error("Invalid formula!")

let x = foo(f, 1 + 2)
echo x.repr
let a = 2
let y = foo(f):
  if a > 1:
    5
  else:
    10
echo y.repr

#+end_src

#+RESULTS:
| [name         | = | foo      |   |     |
| fkVariableval | = | [VIntnum | = | 3]] |
| [name         | = | foo      |   |     |
| fkVariableval | = | [VIntnum | = | 5]] |

where we have replaced the =f{}= syntax by a =foo()= call so that we
can actually import =ggplotnim= and access the actual =FormulaNode=
type. In this version the =formula= template is not even needed,
because we can just insert the pure (implementation pending) formulas
to the new generic =initVariable=.

*** Impure formulas (formulas accessing DF)

If a formula is detected as being impure, we first have to determine
the actual formula kind. This can be done in the same manner as
currently done in =compileFormula=.

Before we get into any of this, let's try to write some helpers that
allow us to construct formulas manually of specific types.

#+begin_src nim :results value drawer
import ggplotnim, sequtils
import arraymancer / laser / strided_iteration / foreach
proc initVectorFormula[T](fnV: proc(df: DataFrame): Column): FormulaNode =
  result = FormulaNode(name: "foo", kind: fkVector, resType: toColKind(T), fnV: fnV)

proc initScalarFormula[T](fnS: proc(df: DataFrame): Value): FormulaNode =
  result = FormulaNode(name: "foo", kind: fkScalar, valKind: toValKind(T), fnS: fnS)

template vecFn(dtype, body: untyped): untyped =
  let cl = proc(df: DataFrame): Column = 
    let df {.inject.} = df
    body
  initVectorFormula[dtype](cl)

template scalarFn(dtype, body: untyped): untyped =
  let cl = proc(df: DataFrame): Value =
    let df {.inject.} = df
    body
  initScalarFormula[dtype](cl)

let f = vecFn(int):
  let t = df["x", int]
  result = toColumn t.map_inline(x * 2)

let f2 = vecFn(int):
  let t = df["x", int]
  var res = newTensor[int](df.len)
  for idx in 0 ..< df.len:
    res[idx] = t[idx] * 2
  result = toColumn res

let f3 = vecFn(int):
  let t = df["x", int]
  var res = newTensor[int](df.len)
  forEach x in res, y in t:
    x = y * 2
  result = toColumn res

let fs = scalarFn(int):
  let t = df["x", int]
  var res: int
  forEach x in t:
    res += x
  result = %~ res

echo f.repr

let df = seqsToDf({"x" : toSeq(0 .. 10)})
echo f.evaluate(df)
echo f2.evaluate(df)
echo f3.evaluate(df)
echo fs.reduce(df)
#+end_src

#+RESULTS:
:results:
[name = 0x7f520ac27060"foo",
fkVectorcolName = "",
resType = colInt,
fnV = [Field0 = 0x5604099338bb,
Field1 = nil]]
Column of type: int with length: 11
  contained Tensor: Tensor[system.int] of shape [11]" on backend "Cpu"
	0	2	4	6	8	10	12	14	16	18	20
Column of type: int with length: 11
  contained Tensor: Tensor[system.int] of shape [11]" on backend "Cpu"
	0	2	4	6	8	10	12	14	16	18	20
Column of type: int with length: 11
  contained Tensor: Tensor[system.int] of shape [11]" on backend "Cpu"
	0	2	4	6	8	10	12	14	16	18	20
55
:end:


In summary the closure implementation of a vector formula consits of 3
parts:
- the preface:
  #+begin_src nim
  let
    t1 = df["t1", dtype1]
    ...
    tn = df["tn", dtypen]
  var res = newTensor[resType](df.len
  #+end_src
- the loop:
  #+begin_src nim
  for / forEach / map_inline / ...:
    # some code using `res`
  #+end_src
- the result:
  #+begin_src nim
  result = toColumn res
  #+end_src

Complications are thus:
- how do we determine the datatypes of the input tensors?
- how do we determine the datatype of the result?
and for the =vecFn= template:
- how do we determine the column type so that =vecFn= could be
  independent to create a =FormulaNode=?


The implementation of reducing formulas is essentially the same,
with the following changes to each of the 3 stages:
- preface:
  #+begin_src nim
  var res: resType
  #+end_src
- the loop:
  #+begin_src nim
  # some code modifying `res`
  #+end_src
- the result:
  #+begin_src nim
  result = %~ res
  #+end_src
and in many cases the whole body can be reduced to a single line, if
the reducing operation simply calls a procedure (e.g. =mean=).

#+begin_src nim
import macros

f{
  preface:
    t in df["foo", int] # t refers to each element of `foo` in the loop
    u in df["bar", float]
    v = df["baz", int] # v refers to the ``Tensor`` `baz`
  dtype: float
  name: "fooBar"
  loop:
    t.float * u + v[idx].float
}

f{
  preface:
    t in df["foo", int] # t refers to each element of `foo` in the loop
    u in df["bar", float]
    v = df["baz", int] # v refers to the ``Tensor`` `baz`
    r in result
  dtype: bool
  name: "filterme"
  loop:
    r = t.float > u and v[idx] < 2.2
}

f{
  preface:
    t in df["foo", float] # t refers to each element of `foo` in the loop
  dtype: bool
  name: "noNan"
  loop:
    not classify(t) == fcNan
}
# then
"noNan" ~ not classify(t) == fcNan
# is just a short form of 
name: "noNan"
loop:
  not classify(t) == fcNan
#+end_src

Have a data type to store this information at CT:
#+begin_src nim
type
  ## either: `t in df["foo", int]`
  ## or: `t = df["foo", int]`
  Assign = object
    element: NimNode # e.g. `t`
    tensor: NimNode # either `t` or `t_T` if `elmenent` used
    col: NimNode # name of the column
    colType: NimNode # e.g. `float`
  Preface = object
    args: seq[Assign]
  FormulaCT = object
    preface: Preface
    resType: NimNode # e.g. `ident"float"`
    name: string # name of the formula body as lisp
    loop: NimNode # loop needs to be patched to remove accented quotes etc
#+end_src
And a function to convert =FormulaCT= into a vector / scalar closure procedure.

Accented quotes / call string literals are converted into =Assign=:
#+begin_src nim
`foo` -> Assign(
  element: fooEl, # gensym
  tensor: fooT, # gensym
  col: foo,
  colType, # heuristics or type hint
)
# same with `c"foo"`
#+end_src

